Import Libraries and Create a File Path

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
pd.set_option('display.max_rows', None)

In [2]:
file_2= "../13-ETL-Project/netflix_titles.csv"
df_2 = pd.read_csv(file_2)
df_2.head(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,"Children & Family Movies, Comedies",Before planning an awesome wedding for his gra...
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,Stand-Up Comedy,Jandino Asporaat riffs on the challenges of ra...
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,Kids' TV,"With the help of three human allies, the Autob..."
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,Kids' TV,When a prison ship crash unleashes hundreds of...
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,Comedies,When nerdy high schooler Dani finally attracts...

Find Column Names

In [3]:
df_2.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

Drop Unnecessary Columns

In [4]:
df_= df_2.drop(['duration','cast','director', 'date_added', 'release_year', 'description', 'country'], axis=1)
df_.head(5)

,show_id,type,title,rating,listed_in
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

Check for Null Values

In [5]:
is_NaN = df_.isnull()
row_has_NaN = is_NaN.any(axis=1)
rows_with_NaN = df_[row_has_NaN]

In [6]:
display(rows_with_NaN.head(5))

,show_id,type,title,rating,listed_in
211,70129452,Movie,Louis C.K.: Hilarious,NaN,Movies
2411,80144119,Movie,My Honor Was Loyalty,NaN,Dramas
3288,80169801,Movie,13TH: A Conversation with Oprah Winfrey & Ava ...,NaN,Movies
4056,80078037,TV Show,Little Lunch,NaN,"Kids' TV, TV Comedies"
4402,80092839,Movie,Fireplace 4K: Classic Crackling Fireplace from...,NaN,Movies

Drop Null Values

In [7]:
df_.dropna(axis=0, how='any', thresh=None, subset=None, inplace=True)
df_.head(5)

,show_id,type,title,rating,listed_in
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

Confirm that Null Values No Longer Exist

In [8]:
is_NaN = df_.isnull()
row_has_NaN = is_NaN.any(axis=1)
rows_with_NaN = df_[row_has_NaN]
display(rows_with_NaN.head(5))

Empty DataFrame
Columns: [show_id, type, title, rating, listed_in]
Index: []

Rename the Columns

In [9]:
df_ = df_.rename(columns={'show_id':'show_id','type':'type','title':'title','rating':'age_rating','listed_in':'category'})
df_.head(5)

,show_id,type,title,age_rating,category
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

Replace Any Other Null Values with Empty String

In [10]:
df_ = df_.replace(np.nan, '', regex=True)
df_.head(5)

,show_id,type,title,age_rating,category
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

## Make Sure the Data Type for Each Column is Correct

In [11]:
df_ = df_.astype({"show_id": int, "type":str, "title": str, "age_rating": str, "category": str})
df_.head(5)

,show_id,type,title,age_rating,category
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

## Check for duplicates 'show_id' and double check the result

In [12]:
df_[df_.duplicated('show_id')]

Empty DataFrame
Columns: [show_id, type, title, age_rating, category]
Index: []

Reset Index

In [13]:
df_.reset_index(drop=True, inplace=True)
df_.head(5)

,show_id,type,title,age_rating,category
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies

## Create database connection

In [20]:
connection_string = "postgres:postgres@localhost:5432/ETL_Project"
engine = create_engine(f'postgresql://{connection_string}')

In [21]:
engine.table_names()

['netflix_rating']

In [22]:
connection = engine.raw_connection()

In [23]:
cur = connection.cursor()

In [24]:
df_.dtypes

show_id        int64
type          object
title         object
age_rating    object
category      object
dtype: object

In [25]:
df_.to_sql('netflix_rating', con=engine, if_exists='append', index=False)

In [26]:
pd.read_sql_query('select * from netflix_rating', con=engine).head()

,show_id,type,title,age_rating,category
0,81145628,Movie,Norm of the North: King Sized Adventure,TV-PG,"Children & Family Movies, Comedies"
1,80117401,Movie,Jandino: Whatever it Takes,TV-MA,Stand-Up Comedy
2,70234439,TV Show,Transformers Prime,TV-Y7-FV,Kids' TV
3,80058654,TV Show,Transformers: Robots in Disguise,TV-Y7,Kids' TV
4,80125979,Movie,#realityhigh,TV-14,Comedies